//
// Created by Ivan Hontarau on 11/1/2021.
//

#include "particles_counter.h"
#include "words_counter.h"

std::vector<std::pair<std::string, std::size_t>> count_particles(const std::string &text) {
    std::vector<std::string> particles = {"не", "ни", "вовсе не", "далеко не", "отнюдь не", "неужели", "разве", "ли",
                                          "ль",
                                          "вот", "вон", "это", "вот", "вон", "это", "именно", "как раз", "прямо",
                                          "подлинно",
                                          "приблизительно", "точно", "точь в точь", "только", "лишь", "исключительно",
                                          "почти",
                                          "единственно", "просто", "хотя бы", "что за", "ну и", "как", "ведь",
                                          "даже", "же",
                                          "ни", "ведь", "уж", "и", "всё", "всё же", "всё-таки", "ну", "едва ли",
                                          "вряд ли", "пусть",
                                          "давай", "дай", "ну", "будто", "как будто", "как бы", "словно", "да", "так",
                                          "правда", "конечно"};
    std::vector<std::string> particlesUpperCase = {"Не", "Ни", "Вовсе не", "Далеко не", "Отнюдь не", "Неужели", "Разве",
                                                   "Ли", "Ль",
                                                   "Вот", "Вон", "Это", "Вот", "Вон", "Это", "Именно", "Как раз",
                                                   "Прямо", "Подлинно",
                                                   "Приблизительно", "Точно", "Точь в точь", "Только", "Лишь",
                                                   "Исключительно",
                                                   "Почти", "Единственно", "Просто", "Хотя бы", "Что за", "Ну и", "Как",
                                                   "Ведь", "Даже",
                                                   "Же", "Ни", "Ведь", "Уж", "И", "Всё", "Всё же", "Всё-таки", "Ну",
                                                   "Едва ли", "Вряд ли",
                                                   "Пусть", "Давай", "Дай", "Ну", "Будто", "Как будто", "Как бы",
                                                   "Словно", "Да", "Так",
                                                   "Правда", "Конечно"};
    return count_words_from_list(text, particles, particlesUpperCase);
}